; domain
(define (domain gripper-strips)
    (:predicates    (room ?r) 
                    (ball ?b) 
                    (gripper ?g)
                    (at-robby ?r) 
                    (at ?b ?r) 
                    (free ?g) 
                    (carry ?o ?g)
    
    )
    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from) (room ?to) (at-robby ?from))
        :effect (and (at-robby ?to) (not (at-robby ?from)))
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition   (and (ball ?obj) (room ?room)
                        (gripper ?gripper) (at ?obj ?room)
                        (at-robby ?room) (free ?gripper))
        :effect     (and (carry ?obj ?gripper) (not (at ?obj ?room))
                    (not (free ?gripper)))
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj) (room ?room) (gripper ?gripper)
                        (carry ?obj ?gripper) (at-robby ?room))
        :effect (and (at ?obj ?room) (free ?gripper)
                    (not (carry ?obj ?gripper)))
    )
)

; problem
(define (problem strip-gripper8)
    (:domain gripper-strips)    
    (:objects   rooma roomb ball1 ball2 ball3 
                ball4 ball5 ball6 ball7 ball8 
                left right
    )
    (:init (room rooma) (room roomb)
            (ball ball1) (ball ball2) (ball ball3) 
            (ball ball4) (ball ball5) (ball ball6)
            (ball ball7) (ball ball8)
            (gripper left) (gripper right)
            (at-robby rooma)
            (free left) (free right)
            (at ball1 rooma) (at ball2 rooma) (at ball3 rooma)
            (at ball4 rooma) (at ball5 rooma) (at ball6 rooma)
            (at ball7 rooma) (at ball8 rooma)
    )
    (:goal (and (at ball1 roomb) (at ball2 roomb) (at ball3 roomb)
                (at ball4 roomb) (at ball5 roomb) (at ball6 roomb)
                (at ball7 roomb))
    )
)

; plan
1. (pick ball7 rooma right)
   deleted: (at ball7 rooma) (free right)
   added: (carry ball7 right)
   goals met: 0 of 7
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 7
3. (drop ball7 roomb right)
   deleted: (carry ball7 right)
   added: (at ball7 roomb) (free right)
   goals met: 1 of 7
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 7
5. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 1 of 7
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 7
7. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 2 of 7
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 7
9. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 2 of 7
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 7
11. (drop ball5 roomb right)
   deleted: (carry ball5 right)
   added: (at ball5 roomb) (free right)
   goals met: 3 of 7
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 7
13. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 3 of 7
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 7
15. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 4 of 7
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 4 of 7
17. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 4 of 7
18. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 7
19. (drop ball3 roomb right)
   deleted: (carry ball3 right)
   added: (at ball3 roomb) (free right)
   goals met: 5 of 7
20. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 5 of 7
21. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 5 of 7
22. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 7
23. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 6 of 7
24. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 7
25. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 6 of 7
26. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 7
27. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 7 of 7
